{
    "layout": "speaker.njk",
    "page": {
        "title": "ServerlessDays Sydney - Julia Davis",
        "description": "Choosing the right boss is just as important as choosing the right organisation. Why? Because having a genuine culture is driven by leadership and the people you work with. Whether you are looking at joining a new organisation, growing your career in your current organisation or thinking about whether to stay or leave your current position, understanding what workplace culture you thrive in should be at the forefront of you decision making. Julia will be chatting through what workplace culture actually is (beyond the beer fridge and table tennis table), how to identify an organisation with a culture of innovation and what the connection is between culture and enjoying your working life. ",
        "url": "https://serverlessdays.io/speakers/ben",
        "image": "https://res.cloudinary.com/du73ags2q/image/upload/c_scale,h_400/v1564969069/julia_qech6e.jpg"
    },
    "speaker": {
        "name": "Julia Davis",
        "title": "Julia is the People & Culture Director of Luxury Escapes",
        "img": "https://res.cloudinary.com/du73ags2q/image/upload/c_scale,h_400/v1564969069/julia_qech6e.jpg",
        "bio": "Julia has over 15 years in senior executive People and Culture positions having worked with some of the biggest organisations in retail, ecommerce, digital and media. She holds experience spanning the full HR remit with niche experience in talent value chain optimisation, developing data-driven talent acquisition, working with high profile personalities, management, development, engagement, and retention and reward strategies that support growth both locally, and globally. As a HR leader she see it as her mission to create value and to lead a culture of innovation. Julia is currently the People & Culture Director of LuxuryEscapes.com, Australia’s fastest growing luxury travel brand. ",
        "talk": {
            "title": "Creating and Holding onto an Innovate Workplace Culture",
            "abstract" : "Choosing the right boss is just as important as choosing the right organisation. Why? Because having a genuine culture is driven by leadership and the people you work with. Whether you are looking at joining a new organisation, growing your career in your current organisation or thinking about whether to stay or leave your current position, understanding what workplace culture you thrive in should be at the forefront of you decision making. Julia will be chatting through what workplace culture actually is (beyond the beer fridge and table tennis table), how to identify an organisation with a culture of innovation and what the connection is between culture and enjoying your working life. "
        },
        "social": [
        ],
        "links": [
            {
                "text": "",
                "link": ""
            }
        ]
    }
}